---
kind: property
id: P:Autodesk.Revit.DB.Ceiling.SketchId
zh: 天花板、吊顶
source: html/6ddc8f5d-8090-9418-82fe-67f55649ebac.htm
---
# Autodesk.Revit.DB.Ceiling.SketchId Property

**中文**: 天花板、吊顶

Returns id of the sketch.

## Syntax (C#)
```csharp
public ElementId SketchId { get; }
```